# Урок001
# ---------------------------------------------------------------------
# a = 5
# b = 5.353
# c = "Dick"

# print(a,"-",b,"-",c)
# print(f"{a} - {b} - {c}")
# print("{} - {} - {}".format(a,b,c))
# -----------------------------------------------------------------------
# print("Введите строку:")
# a = input("Введите строку: ")
# print(a)
# -----------------------------------------------------------------------
# a = float(input("Введите число a: "))
# b = int(input("Введите число b: "))

# print(a, "/", b, "=", round(a / b, 2))
# -----------------------------------------------------------------------
# a = 1 != 4
# print(a)
# c="qwe"
# b="qwe"
# print(c==b)
# -----------------------------------------------------------------------
# numervar=int(input("Введите число: "))
# if numervar==1:
#     print("Один")
# elif numervar==2:
#     print("Два")
# else:
#     print("Другое число")
# -----------------------------------------------------------------------
# n=100
# summa=0
# while n>0:
#     n-=1
#     summa+=n
#     print(n)
# print(summa)
# -----------------------------------------------------------------------
# r = range(10, 1, -1)
# for i in r:
#     print(i)
# -----------------------------------------------------------------------
texta="В лесу родилась елочка. Влесу она жила. И там же померла!"
print(texta[:4:-2])
