# Домашнее задание№2/Семинар№1:
# ========================================================================================================
# Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)
# =========================================================================================================
# Решил: Артем Анатольевич Авдеев
# ________________________________________________________________________________________________________

string_digit = input("Введите число: ")
digit_sum = 0   #сумма цифр числа (число Архимеда)

for i in string_digit:
    digit_sum += int(i)

print("Сумма цифр числа:", digit_sum)
print("Количество цифр числа:", len(string_digit))
# Могём вводить число большой длины!