# день/час

data_60 = {1:("Ян","дерево","Крыса"),
2:("Инь","дерево","Бык"),
3:("Ян","огонь","Тигр"),
4:("Инь","огонь","Кролик"),
5:("Ян","земля","Дракон"),
6:("Инь","земля","Змея"),
7:("Ян","металл","Лошадь"),
8:("Инь","металл","Коза"),
9:("Ян","вода","Обзеъяна"),
10:("Инь","вода","Петух"),
11:("Ян","дерево","Собака"),
12:("Инь","дерево","Свинья"),
13:("Ян","огонь","Крыса"),
14:("Инь","огонь","Бык"),
15:("Ян","земля","Тигр"),
16:("Инь","земля","Кролик"),
17:("Ян","металл","Дракон"),
18:("Инь","металл","Змея"),
19:("Ян","вода","Лошадь"),
20:("Инь","вода","Коза"),
21:("Ян","дерево","Обзеъяна"),
22:("Инь","дерево","Петух"),
23:("Ян","огонь","Собака"),
24:("Инь","огонь","Свинья"),
25:("Ян","земля","Крыса"),
26:("Инь","земля","Бык"),
27:("Ян","металл","Тигр"),
28:("Инь","металл","Кролик"),
29:("Ян","вода","Дракон"),
30:("Инь","вода","Змея"),
31:("Ян","дерево","Лошадь"),
32:("Инь","дерево","Коза"),
33:("Ян","огонь","Обзеъяна"),
34:("Инь","огонь","Петух"),
35:("Ян","земля","Собака"),
36:("Инь","земля","Свинья"),
37:("Ян","металл","Крыса"),
38:("Инь","металл","Бык"),
39:("Ян","вода","Тигр"),
40:("Инь","вода","Кролик"),
41:("Ян","дерево","Дракон"),
42:("Инь","дерево","Змея"),
43:("Ян","огонь","Лошадь"),
44:("Инь","огонь","Коза"),
45:("Ян","земля","Обзеъяна"),
46:("Инь","земля","Петух"),
47:("Ян","металл","Собака"),
48:("Инь","металл","Свинья"),
49:("Ян","вода","Крыса"),
50:("Инь","вода","Бык"),
51:("Ян","дерево","Тигр"),
52:("Инь","дерево","Кролик"),
53:("Ян","огонь","Дракон"),
54:("Инь","огонь","Змея"),
55:("Ян","земля","Лошадь"),
56:("Инь","земля","Коза"),
57:("Ян","металл","Обзеъяна"),
58:("Инь","металл","Петух"),
59:("Ян","вода","Собака"),
60:("Инь","вода","Свинья"),
}
# --------------------------------------------------------------------------------------------------------
num = int(input("введите число от 1 до 60:"))

print("В день:",data_60[num][0], data_60[num][1], data_60[num][2])
print("Входят следующие двух-часовки:")

start = ((num - 1) % 5) * 12 + 1
end = ((num - 1) % 5 + 1) * 12
for i in range(start, end+1):
    print(data_60[i][0], data_60[i][1], data_60[i][2])
# --------------------------------------------------------------------------------------------------------
time = input("Введите время в формате HH:MM: ")
hour = int(time.split(':')[0])

animals = ['Крыса', 'Бык', 'Тигр', 'Кролик', 'Дракон', 'Змея', 'Лошадь', 'Коза', 'Обезьяна', 'Петух', 'Собака', 'Свинья']

index = (hour + 1) % 24 // 2
print(animals[index])

